Repository: Gondocs/ktsgallery
Catalog: languages/kts-gallery-*.po
Languages: hu_hu

source: Galleries
hu_hu: Galériák

source: Gallery
hu_hu: Galéria

source: Add New
hu_hu: Új hozzáadása

source: Add New Gallery
hu_hu: Új galéria hozzáadása

source: Edit Gallery
hu_hu: Galéria szerkesztése

source: New Gallery
hu_hu: Új galéria

source: View Gallery
hu_hu: Galéria megtekintése

source: Search Galleries
hu_hu: Galériák keresése

source: No galleries found
hu_hu: Nem találhatók galériák

source: No galleries found in Trash
hu_hu: Nem találhatók galériák a Kukában

source: All Galleries
hu_hu: Összes galéria

source: KTS Gallery
hu_hu: KTS Galéria

source: Gallery Images
hu_hu: Galéria képek

source: Gallery Settings
hu_hu: Galéria beállítások

source: Add or upload images. Drag to reorder. Click the pencil icon to edit, or ✕ to remove.
hu_hu: Képek hozzáadása vagy feltöltése. Húzd át az átrendezéshez. Kattints a ceruza ikonra a szerkesztéshez, vagy az ✕-re az eltávolításhoz.

source: Select / Upload Images
hu_hu: Képek kiválasztása / Feltöltése

source: Edit
hu_hu: Szerkesztés

source: Remove
hu_hu: Eltávolítás

source: Layout
hu_hu: Elrendezés

source: Media
hu_hu: Média

source: Appearance
hu_hu: Megjelenés

source: Layout Type
hu_hu: Elrendezés típusa

source: Grid
hu_hu: Rács

source: Square
hu_hu: Négyzet

source: Masonry
hu_hu: Téglafalszerű

source: Blogroll
hu_hu: Blog lista

source: Automatic (Justified)
hu_hu: Automatikus (Sorkizárt)

source: Grid: Fixed columns. Square: Equal aspect ratio. Masonry: Pinterest-style. Automatic: Justified rows with natural heights.
hu_hu: Rács: Fix oszlopok. Négyzet: Egyenlő oldalarány. Téglafalszerű: Pinterest-stílus. Automatikus: Sorkizárt sorok természetes magassággal.

source: Number of Columns
hu_hu: Oszlopok száma

source: Number of columns for Grid, Square, and Blogroll layouts.
hu_hu: Az oszlopok száma a Rács, Négyzet és Blog lista elrendezésekhez.

source: Responsive Columns
hu_hu: Reszponzív oszlopok

source: Minimum Column Width
hu_hu: Minimális oszlopszélesség

source: When responsive columns is enabled, columns automatically adjust based on this minimum width.
hu_hu: Ha a reszponzív oszlopok engedélyezve vannak, az oszlopok automatikusan igazodnak ehhez a minimális szélességhez.

source: Gap Between Images
hu_hu: Képek közötti térköz

source: Spacing between gallery items. Use px, rem, or other CSS units.
hu_hu: A galéria elemek közötti távolság. Használj px, rem vagy más CSS egységeket.

source: Image Height
hu_hu: Kép magassága

source: Fixed height for Grid and Square layouts. Not used in Masonry or Automatic layouts.
hu_hu: Fix magasság a Rács és Négyzet elrendezésekhez. Nem használt a Téglafalszerű vagy Automatikus elrendezéseknél.

source: Automatic Layout Settings
hu_hu: Automatikus elrendezés beállításai

source: Target Row Height
hu_hu: Cél sormagasság

source: Image Spacing
hu_hu: Képek távolsága

source: For Automatic layout: Images fill each row maintaining aspect ratio. Row height is approximate.
hu_hu: Automatikus elrendezésnél: A képek kitöltik a sorokat, megtartva az oldalarányt. A sormagasság hozzávetőleges.

source: WordPress Image Size
hu_hu: WordPress képméret

source: Thumbnail
hu_hu: Miniatűr

source: Medium
hu_hu: Közepes

source: Large
hu_hu: Nagy

source: Original Image
hu_hu: Eredeti kép

source: Custom Size
hu_hu: Egyéni méret

source: Choose a predefined WordPress image size or select Custom to specify exact dimensions.
hu_hu: Válassz egy előre definiált WordPress képméretet, vagy válaszd az Egyéni lehetőséget a pontos méretek megadásához.

source: Crop Images
hu_hu: Képek körülvágása

source: Crop images to fit the defined height. Uncheck to show full image with natural aspect ratio.
hu_hu: Képek körülvágása a megadott magassághoz. Kikapcsolva a teljes kép jelenik meg természetes oldalaránnyal.

source: Custom Image Dimensions
hu_hu: Egyéni képméretek

source: Set custom width and height. Leave empty for auto sizing. Used when Custom Size is selected.
hu_hu: Állíts be egyéni szélességet és magasságot. Hagyd üresen az automatikus méretezéshez. Az Egyéni méret kiválasztásakor használatos.

source: Enable Lazy Loading
hu_hu: Lusta betöltés engedélyezése

source: Delay loading images until they are about to enter the viewport. Improves page load performance.
hu_hu: A képek betöltésének késleltetése, amíg nem érik el a látómezőt. Javítja az oldalbetöltés teljesítményét.

source: Gallery Alignment
hu_hu: Galéria igazítása

source: Left
hu_hu: Balra

source: Center
hu_hu: Középre

source: Right
hu_hu: Jobbra

source: Horizontal alignment of the entire gallery container on the page.
hu_hu: A teljes galéria konténer vízszintes igazítása az oldalon.

source: Gallery Width (%)
hu_hu: Galéria szélessége (%)

source: Maximum width of the gallery as a percentage of the container. Use 100% for full width.
hu_hu: A galéria maximális szélessége a konténer százalékában. Használj 100%-ot a teljes szélességhez.

source: Gallery Padding
hu_hu: Galéria belső margó

source: Internal padding around the gallery content. Use CSS units like px, rem, or em.
hu_hu: Belső margó a galéria tartalma körül. Használj CSS egységeket, mint px, rem vagy em.

source: Image Styling
hu_hu: Kép stílusa

source: Corner Radius
hu_hu: Sarok lekerekítés

source: Rounded corners for images. Use 0 for sharp corners, or values like 8px for rounded edges.
hu_hu: Lekerekített sarkok a képekhez. Használj 0-t az éles sarkokhoz, vagy értékeket, mint 8px a lekerekített élekhez.

source: Border
hu_hu: Szegély

source: Add a border around each image. Specify width and color (use hex, rgb, or CSS color names).
hu_hu: Adj szegélyt minden képhez. Add meg a szélességet és a színt (használj hex, rgb vagy CSS színneveket).

source: Drop Shadow
hu_hu: Vetett árnyék

source: Add a subtle shadow effect to images for depth and visual separation.
hu_hu: Finom árnyék effektus hozzáadása a képekhez a mélység és vizuális elkülönítés érdekében.

source: Disable Right Click
hu_hu: Jobb klikk letiltása

source: Prevent users from right-clicking on images to protect against easy downloading.
hu_hu: Megakadályozza a felhasználókat a képekre való jobb kattintásban, hogy védje a könnyű letöltés ellen.

source: Enable Lightbox
hu_hu: Lightbox engedélyezése

source: Enable the popup image viewer that opens when clicking on gallery images. Allows users to view full-size images with navigation controls.
hu_hu: Engedélyezd a felugró képnézőt, amely megnyílik a galéria képeire kattintva. Lehetővé teszi a felhasználók számára a teljes méretű képek megtekintését navigációs vezérlőkkel.

source: Photo Title Display
hu_hu: Fotó cím megjelenítése

source: Show Title on Hover
hu_hu: Cím megjelenítése rámutatáskor

source: Display image titles with a smooth animation when hovering over gallery thumbnails.
hu_hu: Képcímek megjelenítése sima animációval a galéria miniatűrjei fölé való rámutatáskor.

source: Show Title in Lightbox
hu_hu: Cím megjelenítése a Lightboxban

source: Display image titles below the photo when viewing in the lightbox popup.
hu_hu: Képcímek megjelenítése a fotó alatt a lightbox felugró ablakban való megtekintéskor.

source: You can enable one, both, or neither option. Edit image titles by clicking the pencil icon on thumbnails in the Gallery Images section above.
hu_hu: Engedélyezhetsz egyet, mindkettőt, vagy egyiket sem. Szerkeszd a képcímeket a ceruza ikonra kattintva a miniatűrökön a fenti Galéria képek részben.

source: Shortcodes
hu_hu: Rövidkódok

source: (public number)
hu_hu: (nyilvános szám)

source: not assigned yet (will be generated on save)
hu_hu: még nincs hozzárendelve (mentéskor jön létre)

source: Preview
hu_hu: Előnézet

source: Title
hu_hu: Cím

source: Shortcode
hu_hu: Rövidkód

source: Duplicate
hu_hu: Duplikálás

source: (Copy)
hu_hu: (Másolat)

source: Gallery duplicated. You can now edit the copy.
hu_hu: Galéria duplikálva. Most már szerkesztheted a másolatot.

source: You do not have permission to duplicate this item.
hu_hu: Nincs jogosultságod ennek az elemnek a duplikálásához.

source: Invalid request.
hu_hu: Érvénytelen kérés.

source: Invalid gallery.
hu_hu: Érvénytelen galéria.
